In [1]:
import pandas as pd

In [2]:
m = [1, 2, 3, 4, 5, 6, 7, 8]

In [5]:
index = 0
for i in m:
    i = i * i
    m[index] = i
    index += 1
    
print(m)

[1, 4, 9, 16, 25, 36, 49, 64]

In [7]:
df = pd.DataFrame(
    {'column_1': ['one', 'two'],
    'column_2': ['three', 'four']}
    )

In [10]:
df.head()

  column_1 column_2
0      one    three
1      two     four